; domain
(define (domain zeno-travel)
(:requirements :typing :strips)
(:types transportable city flevel - object
        aircraft person - transportable)

(:predicates (at ?x - transportable ?c - city)
             (in ?a - aircraft ?p - person)
	     (fuel-level ?a - aircraft ?l - flevel)
	     (next ?l1 - flevel ?l2 - flevel))


(:action board
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (at ?a ?c)
                 (at ?b ?c))
 :effect (and (not (at ?a ?c))
              (in ?a ?b)))

(:action debark
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (in ?a ?b)
                 (at ?b ?c))
 :effect (and (not (in ?a ?b))
              (at ?a ?c)))

(:action fly
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d))
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?e)))

(:action zoom
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel ?f - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d)
		 (next ?f ?e)
		)
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?f)
	)
)

(:action refuel
 :parameters (?a - aircraft ?b - city ?c - flevel ?d - flevel)

 :precondition (and (fuel-level ?a ?c)
                 (next ?c ?d)
                 (at ?a ?b))
 :effect (and (fuel-level ?a ?d) (not (fuel-level ?a ?c))))


)

; problem
(define (problem ZTRAVEL-7-14)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	plane5 - aircraft
	plane6 - aircraft
	plane7 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	city8 - city
	city9 - city
	city10 - city
	city11 - city
	fl0 - flevel
	fl1 - flevel
	fl2 - flevel
	fl3 - flevel
	fl4 - flevel
	fl5 - flevel
	fl6 - flevel
	)
(:init
	(at plane1 city6)
	(fuel-level plane1 fl4)
	(at plane2 city1)
	(fuel-level plane2 fl0)
	(at plane3 city1)
	(fuel-level plane3 fl3)
	(at plane4 city7)
	(fuel-level plane4 fl1)
	(at plane5 city0)
	(fuel-level plane5 fl0)
	(at plane6 city4)
	(fuel-level plane6 fl1)
	(at plane7 city8)
	(fuel-level plane7 fl1)
	(at person1 city2)
	(at person2 city5)
	(at person3 city9)
	(at person4 city2)
	(at person5 city5)
	(at person6 city9)
	(at person7 city9)
	(at person8 city8)
	(at person9 city8)
	(at person10 city10)
	(at person11 city6)
	(at person12 city11)
	(at person13 city3)
	(at person14 city3)
	(next fl0 fl1)
	(next fl1 fl2)
	(next fl2 fl3)
	(next fl3 fl4)
	(next fl4 fl5)
	(next fl5 fl6)
)
(:goal (and
	(at plane1 city7)
	(at person1 city8)
	(at person2 city6)
	(at person3 city5)
	(at person4 city7)
	(at person5 city5)
	(at person6 city5)
	(at person7 city11)
	(at person8 city3)
	(at person9 city10)
	(at person10 city8)
	(at person12 city4)
	(at person13 city1)
	(at person14 city4)
	))

)

; plan
1. (board person9 plane7 city8)
   deleted: (at person9 city8)
   added: (in person9 plane7)
   goals met: 1 of 14
2. (board person8 plane7 city8)
   deleted: (at person8 city8)
   added: (in person8 plane7)
   goals met: 1 of 14
3. (zoom plane1 city6 city10 fl4 fl3 fl2)
   deleted: (at plane1 city6) (fuel-level plane1 fl4)
   added: (at plane1 city10) (fuel-level plane1 fl2)
   goals met: 1 of 14
4. (board person10 plane1 city10)
   deleted: (at person10 city10)
   added: (in person10 plane1)
   goals met: 1 of 14
5. (fly plane7 city8 city10 fl1 fl0)
   deleted: (at plane7 city8) (fuel-level plane7 fl1)
   added: (at plane7 city10) (fuel-level plane7 fl0)
   goals met: 1 of 14
6. (refuel plane7 city10 fl0 fl1)
   deleted: (fuel-level plane7 fl0)
   added: (fuel-level plane7 fl1)
   goals met: 1 of 14
7. (debark person9 plane7 city10)
   deleted: (in person9 plane7)
   added: (at person9 city10)
   goals met: 2 of 14
8. (fly plane7 city10 city3 fl1 fl0)
   deleted: (at plane7 city10) (fuel-level plane7 fl1)
   added: (at plane7 city3) (fuel-level plane7 fl0)
   goals met: 2 of 14
9. (debark person8 plane7 city3)
   deleted: (in person8 plane7)
   added: (at person8 city3)
   goals met: 3 of 14
10. (board person14 plane7 city3)
   deleted: (at person14 city3)
   added: (in person14 plane7)
   goals met: 3 of 14
11. (refuel plane7 city3 fl0 fl1)
   deleted: (fuel-level plane7 fl0)
   added: (fuel-level plane7 fl1)
   goals met: 3 of 14
12. (board person13 plane7 city3)
   deleted: (at person13 city3)
   added: (in person13 plane7)
   goals met: 3 of 14
13. (fly plane7 city3 city1 fl1 fl0)
   deleted: (at plane7 city3) (fuel-level plane7 fl1)
   added: (at plane7 city1) (fuel-level plane7 fl0)
   goals met: 3 of 14
14. (refuel plane7 city1 fl0 fl1)
   deleted: (fuel-level plane7 fl0)
   added: (fuel-level plane7 fl1)
   goals met: 3 of 14
15. (debark person13 plane7 city1)
   deleted: (in person13 plane7)
   added: (at person13 city1)
   goals met: 4 of 14
16. (fly plane7 city1 city4 fl1 fl0)
   deleted: (at plane7 city1) (fuel-level plane7 fl1)
   added: (at plane7 city4) (fuel-level plane7 fl0)
   goals met: 4 of 14
17. (debark person14 plane7 city4)
   deleted: (in person14 plane7)
   added: (at person14 city4)
   goals met: 5 of 14
18. (zoom plane1 city10 city7 fl2 fl1 fl0)
   deleted: (at plane1 city10) (fuel-level plane1 fl2)
   added: (at plane1 city7) (fuel-level plane1 fl0)
   goals met: 6 of 14
19. (zoom plane3 city1 city11 fl3 fl2 fl1)
   deleted: (at plane3 city1) (fuel-level plane3 fl3)
   added: (at plane3 city11) (fuel-level plane3 fl1)
   goals met: 6 of 14
20. (board person12 plane3 city11)
   deleted: (at person12 city11)
   added: (in person12 plane3)
   goals met: 6 of 14
21. (fly plane3 city11 city4 fl1 fl0)
   deleted: (at plane3 city11) (fuel-level plane3 fl1)
   added: (at plane3 city4) (fuel-level plane3 fl0)
   goals met: 6 of 14
22. (debark person12 plane3 city4)
   deleted: (in person12 plane3)
   added: (at person12 city4)
   goals met: 7 of 14
23. (fly plane4 city7 city2 fl1 fl0)
   deleted: (at plane4 city7) (fuel-level plane4 fl1)
   added: (at plane4 city2) (fuel-level plane4 fl0)
   goals met: 7 of 14
24. (board person4 plane4 city2)
   deleted: (at person4 city2)
   added: (in person4 plane4)
   goals met: 7 of 14
25. (refuel plane4 city2 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 7 of 14
26. (board person1 plane4 city2)
   deleted: (at person1 city2)
   added: (in person1 plane4)
   goals met: 7 of 14
27. (refuel plane1 city7 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 7 of 14
28. (fly plane6 city4 city5 fl1 fl0)
   deleted: (at plane6 city4) (fuel-level plane6 fl1)
   added: (at plane6 city5) (fuel-level plane6 fl0)
   goals met: 7 of 14
29. (board person2 plane6 city5)
   deleted: (at person2 city5)
   added: (in person2 plane6)
   goals met: 7 of 14
30. (refuel plane6 city5 fl0 fl1)
   deleted: (fuel-level plane6 fl0)
   added: (fuel-level plane6 fl1)
   goals met: 7 of 14
31. (fly plane6 city5 city6 fl1 fl0)
   deleted: (at plane6 city5) (fuel-level plane6 fl1)
   added: (at plane6 city6) (fuel-level plane6 fl0)
   goals met: 7 of 14
32. (debark person2 plane6 city6)
   deleted: (in person2 plane6)
   added: (at person2 city6)
   goals met: 8 of 14
33. (fly plane4 city2 city7 fl1 fl0)
   deleted: (at plane4 city2) (fuel-level plane4 fl1)
   added: (at plane4 city7) (fuel-level plane4 fl0)
   goals met: 8 of 14
34. (refuel plane4 city7 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 8 of 14
35. (debark person4 plane4 city7)
   deleted: (in person4 plane4)
   added: (at person4 city7)
   goals met: 9 of 14
36. (fly plane4 city7 city8 fl1 fl0)
   deleted: (at plane4 city7) (fuel-level plane4 fl1)
   added: (at plane4 city8) (fuel-level plane4 fl0)
   goals met: 9 of 14
37. (debark person1 plane4 city8)
   deleted: (in person1 plane4)
   added: (at person1 city8)
   goals met: 10 of 14
38. (fly plane1 city7 city9 fl1 fl0)
   deleted: (at plane1 city7) (fuel-level plane1 fl1)
   added: (at plane1 city9) (fuel-level plane1 fl0)
   goals met: 9 of 14
39. (refuel plane1 city9 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 9 of 14
40. (board person7 plane1 city9)
   deleted: (at person7 city9)
   added: (in person7 plane1)
   goals met: 9 of 14
41. (board person6 plane1 city9)
   deleted: (at person6 city9)
   added: (in person6 plane1)
   goals met: 9 of 14
42. (board person3 plane1 city9)
   deleted: (at person3 city9)
   added: (in person3 plane1)
   goals met: 9 of 14
43. (fly plane1 city9 city5 fl1 fl0)
   deleted: (at plane1 city9) (fuel-level plane1 fl1)
   added: (at plane1 city5) (fuel-level plane1 fl0)
   goals met: 9 of 14
44. (refuel plane1 city5 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 9 of 14
45. (debark person6 plane1 city5)
   deleted: (in person6 plane1)
   added: (at person6 city5)
   goals met: 10 of 14
46. (debark person3 plane1 city5)
   deleted: (in person3 plane1)
   added: (at person3 city5)
   goals met: 11 of 14
47. (fly plane1 city5 city11 fl1 fl0)
   deleted: (at plane1 city5) (fuel-level plane1 fl1)
   added: (at plane1 city11) (fuel-level plane1 fl0)
   goals met: 11 of 14
48. (refuel plane1 city11 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 11 of 14
49. (debark person7 plane1 city11)
   deleted: (in person7 plane1)
   added: (at person7 city11)
   goals met: 12 of 14
50. (fly plane1 city11 city8 fl1 fl0)
   deleted: (at plane1 city11) (fuel-level plane1 fl1)
   added: (at plane1 city8) (fuel-level plane1 fl0)
   goals met: 12 of 14
51. (refuel plane1 city8 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 12 of 14
52. (debark person10 plane1 city8)
   deleted: (in person10 plane1)
   added: (at person10 city8)
   goals met: 13 of 14
53. (fly plane1 city8 city7 fl1 fl0)
   deleted: (at plane1 city8) (fuel-level plane1 fl1)
   added: (at plane1 city7) (fuel-level plane1 fl0)
   goals met: 14 of 14
